УНФ_ТЕСТ.BizOn_WMS_MES/src/Catalogs/БЗ_MES_СтандартныеКомпоновкиДеталей/БЗ_MES_СтандартныеКомпоновкиДеталей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БЗ_MES_СтандартныеКомпоновкиДеталей</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНаладки</name>
    <type>
      <types>CatalogRef.БЗ_MES_ВариантыНаладки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрограммы</name>
    <type>
      <types>EnumRef.БЗ_ВидыПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологическаяОперация</name>
    <type>
      <types>CatalogRef.БЗ_ТехнологическиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМатериалаКомпоновки</name>
    <type>
      <types>CatalogRef.БЗ_MES_ВидыМатериаловКомпоновки</types>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлПрограммы</name>
    <type>
      <types>CatalogRef.БЗ_MES_ФайлыПрограммСтанков</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УНФ_ТЕСТ.BizOn_WMS_MES/src/Catalogs/БЗ_MES_ФайлыПрограммСтанков/БЗ_MES_ФайлыПрограммСтанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БЗ_MES_ФайлыПрограммСтанков</name>
  <attributes>
    <name>ФайлПрограммы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешФункция</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Стандартный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехнологическаяОперация</name>
    <type>
      <types>CatalogRef.БЗ_ТехнологическиеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПрограммы</name>
    <type>
      <types>EnumRef.БЗ_ВидыПрограмм</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНаладки</name>
    <type>
      <types>CatalogRef.БЗ_MES_ВариантыНаладки</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ.BizOn_WMS_MES/src/Catalogs/БЗ_MES_СтандартныеКомпоновкиДеталей/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ДобавитьФайлНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ДобавитьФайлКомпоновкиНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлКомпоновки(Команда)
    Если НЕ ПодключитьРасширениеРаботыСФайлами() Тогда
        УстановитьРасширениеРаботыСФайлами();
    КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Сообщить("Заполните наименование");
		ЭтаФорма.ТекущийЭлемент = Элементы.Наименование;
		Возврат;
	КонецЕсли;
	
    Адрес = "";            
	ВидПрограммы  = ПолучитьПараметр("ВидПрограммы");
	
	Если ЗначениеЗаполнено(ВидПрограммы) Тогда     
		ВидПрограммыС=Строка(ВидПрограммы);
		ВидПрограммыС_Нач = СтрНайти(ВидПрограммыС,"("); 
		ВидПрограммыС_Кон = СтрНайти(ВидПрограммыС,")"); 
		РасширениеФайла = "*."+?(ВидПрограммыС_Нач>0 И ВидПрограммыС_Кон>0, Сред(ВидПрограммыС,ВидПрограммыС_Нач+1, ВидПрограммыС_Кон-ВидПрограммыС_Нач-1),"*");
	Иначе
		ВидПрограммыС="";
		РасширениеФайла = "*.*";
	КонецЕсли;
    ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтаФорма);

	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = ВидПрограммыС	    +"|"+РасширениеФайла;	
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл программы";
    НачатьПомещениеФайла(ОписаниеОповещения, Адрес, ДиалогОткрытияФайла, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(Результат, Адрес, ВыбранныйФайл, ДополнительныеПараметры) Экспорт
	
    Если НЕ Результат Тогда
        Возврат;
    КонецЕсли;

    Файл = Новый Файл(ВыбранныйФайл);
	
	ПараметрыФайла = Новый Структура;   
	ПараметрыФайла.Вставить("ИмяФайла", Файл.Имя);
 	ПараметрыФайла.Вставить("ПутьФайла", Файл.Путь);
    // для записи в реквизит с типом хранилище значения
	
	Отказ = Ложь;
	ОписаниеОшибки = "";
	АдресЗагруженногоФайла = Адрес;
	ЗагрузитьНаСервере(АдресЗагруженногоФайла, ПараметрыФайла, Отказ, ОписаниеОшибки);

КонецПроцедуры           
&НаСервере
Процедура ЗагрузитьНаСервере(АдресЗагруженногоФайла, ПараметрыФайла, Отказ, ОписаниеОшибки)
 	ПараметрыФайла.Вставить("ТехнологическаяОперация", ПолучитьПараметр("ТехнологическаяОперация"));
 	ПараметрыФайла.Вставить("ВидПрограммы", ПолучитьПараметр("ВидПрограммы"));
 	ПараметрыФайла.Вставить("ВариантНаладки", ПолучитьПараметр("ВариантНаладки"));
 	ПараметрыФайла.Вставить("ВидМатериалаКомпоновки", ПолучитьПараметр("ВидМатериалаКомпоновки"));
 	ПараметрыФайла.Вставить("Стандартный", Истина);
    ПараметрыФайла.Вставить("Наименование", "Стд. "+ПолучитьПараметр("ТехнологическаяОперация")+" ["+Объект.Код+"] "+Объект.Наименование);

	Объект.ФайлПрограммы = Справочники.БЗ_MES_ФайлыПрограммСтанков.ДобавитьФайлИзВХ(АдресЗагруженногоФайла, ПараметрыФайла, Отказ, ОписаниеОшибки);	
КонецПроцедуры	
&НаСервере
Функция ПолучитьПараметрРодителя(Родитель, Элемент) 
	Если ЗначениеЗаполнено(Родитель[Элемент]) Тогда
		Возврат Родитель[Элемент];
	ИначеЕсли ЗначениеЗаполнено(Родитель.Родитель) Тогда
		Возврат ПолучитьПараметрРодителя(Родитель.Родитель, Элемент)
	Иначе
		Возврат ""
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьПодсказкуВвода("ТехнологическаяОперация");
	УстановитьПодсказкуВвода("ВидПрограммы");
	УстановитьПодсказкуВвода("ВариантНаладки");
	УстановитьПодсказкуВвода("ВидМатериалаКомпоновки");
	АвтообновлениеНаименования = НЕ ЗначениеЗаполнено(Объект.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПодсказкуВвода (Элемент)          
	Элементы[Элемент].ПодсказкаВвода = ПолучитьПараметрРодителя(Объект.Родитель, Элемент);  
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметр(Элемент)
	Если ЗначениеЗаполнено(Объект[Элемент]) Тогда   
		Возврат Объект[Элемент];
	Иначе
		Возврат ПолучитьПараметрРодителя(Объект.Родитель,Элемент);
	КонецЕсли;      
КонецФункции
&НаСервере
Процедура ИзменитьНаименованиеНаСервере()
	ВремНаименование = "";                    
	ПервыйПроход = Истина;
	Для Каждого СтрокаТовары из Объект.Товары Цикл
		ВремНаименование = ВремНаименование + ?(ПервыйПроход, "", " , "); 	
		ВремНаименование = ВремНаименование + ?(ЗначениеЗаполнено(СтрокаТовары.Номенклатура),СтрокаТовары.Номенклатура.Наименование+"("+СтрокаТовары.Характеристика.Наименование+")х"+СтрокаТовары.Количество,"");	
		ПервыйПроход = Ложь;
	КонецЦикла;
	Объект.Наименование = ВремНаименование;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	//Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		ИзменитьНаименованиеНаСервере();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаименование(Команда)
	ИзменитьНаименованиеНаСервере();

КонецПроцедуры
